const scoring = [
  {
    name: "Достовірність",
    yes: [],
    no: [1, 10, 19, 31, 51, 69, 78, 92, 101, 116, 128, 138, 148],
  },

  {
    name: "Поведінкова регуляція",
    yes: [
      4, 6, 7, 8, 11, 12, 15, 16, 17, 18, 20, 21, 28, 29, 30, 36, 37, 39, 40,
      41, 47, 57, 60, 63, 65, 67, 68, 70, 73, 80, 82, 83, 84, 86, 89, 94, 95,
      96, 98, 102, 103, 108, 109, 110, 111, 112, 113, 115, 117, 118, 119, 120,
      122, 123, 124, 125, 127, 129, 131, 135, 136, 137, 139, 143, 146, 149, 153,
      154, 155, 156, 157, 158, 161, 162,
    ],
    no: [
      2, 3, 5, 23, 25, 32, 38, 44, 45, 52, 53, 54, 55, 58, 62, 66, 75, 87, 105,
      132, 134, 140,
    ],
  },
  {
    name: "Комунікативний потенціал",
    yes: [
      9, 24, 27, 43, 46, 61, 64, 81, 88, 90, 99, 104, 106, 114, 121, 126, 133,
      142, 151, 152,
    ],
    no: [26, 34, 35, 48, 49, 74, 85, 107, 130, 144, 147, 159],
  },
  {
    name: "Моральноетична нормативність",
    yes: [
      14, 22, 33, 42, 50, 56, 59, 71, 72, 77, 79, 91, 93, 141, 145, 150, 164,
      165,
    ],
    no: [13, 76, 97, 100, 160, 163],
  },
  {
    name: "Військовопрофесійна спрямованість",
    yes: [
      166, 167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 179, 180, 181, 183,
      184, 185, 186, 187, 188, 190,
    ],
    no: [171, 178, 182, 189],
  },
  {
    name: "Схильність до девіантних форм поведінки",
    yes: [
      6, 9, 14, 15, 22, 36, 39, 42, 47, 50, 56, 59, 71, 72, 91, 93, 117, 127,
      141, 145, 151, 152, 164, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200,
    ],
    no: [13, 100, 163],
  },
  {
    name: "Суїцидальний ризик",
    yes: [
      4, 8, 10, 28, 29, 39, 41, 47, 70, 84, 115, 119, 124, 136, 137, 149, 154,
      155,
    ],
    no: [32, 105],
    description: "DESCRIPTION",
  },
];
const interpretation = {
  Достовірність: [
    {
      min: 0,
      max: 5,
      text: "Висока достовірність",
      description: "",
    },

    {
      min: 6,
      max: 9,
      text: "Достатня достовірність",
    },

    {
      min: 10,
      max: Infinity,
      text: "Результати недостовірні",
    },
  ],
  "Поведінкова регуляція": [
    {
      min: 0,
      max: 4,
      text: "10 Стен",
      description: `<p>Високий рівень нервово-психічної стійкості і
                    поведінкової регуляції. Високий рівень працездатності, у
                    тому числі і в умовах вираженого стресу. Висока
                    толерантність до несприятливих психічних і фізичних
                    навантажень.`,
    },

    {
      min: 5,
      max: 5,
      text: "9 Стен",
      description: `<p>Високий рівень нервово-психічної стійкості і
                    поведінкової регуляції. Високий рівень працездатності, у
                    тому числі і в умовах вираженого стресу. Висока
                    толерантність до несприятливих психічних і фізичних
                    навантажень.`,
    },

    {
      min: 6,
      max: 8,
      text: "8 Стен",
      description: `<p>Високий рівень нервово-психічної стійкості і
                    поведінкової регуляції. Високий рівень працездатності, у
                    тому числі і в умовах вираженого стресу. Висока
                    толерантність до несприятливих психічних і фізичних
                    навантажень.`,
    },
    {
      min: 9,
      max: 12,
      text: "7 Стен",
      description: `<p>Достатньо високий рівень нервово-психічної стійкості і
                    поведінкової регуляції. Достатньо високий рівень
                    працездатності, у тому числі і в ускладнених умовах
                    діяльності. Достатньо висока толерантність до психічних
                    і фізичних навантажень. Достатньо висока стійкість до дії
                    стрес-чинників.`,
    },
    {
      min: 13,
      max: 18,
      text: "6 Стен",
      description: `<p>Достатній рівень нервово-психічної стійкості і
                    поведінкової регуляції. Достатній рівень працездатності, у
                    тому числі і в ускладнених умовах діяльності. Достатня
                    толерантність до психічних і фізичних навантажень.
                    Достатня стійкість до дії стрес-чинників.`,
    },
    {
      min: 19,
      max: 26,
      text: "5 Стен",
      description: `<p>В цілому достатній рівень нервово-психічної стійкості і
                    поведінкової регуляції. Стійкий рівень працездатності у
                    звичних умовах життєдіяльності. При тривалій дії явних
                    психічних навантажень можливо тимчасове погіршення
                    якості діяльності.`,
    },
    {
      min: 27,
      max: 34,
      text: "4 Стен",
      description: `<p>Дещо понижений рівень нервово-психічної стійкості і
                    поведінкової регуляції. Нестабільний рівень працездатності,
                    що особливо проявляється в ускладнених умовах
                    діяльності. Адаптація до нових і незвичайних умов
                    життєдіяльності ускладнена і може супроводжуватися
                    тимчасовим погіршенням функціонального стану організму`,
    },
    {
      min: 35,
      max: 45,
      text: "3 Стен",
      description: `<p>Окремі ознаки нервово-психічної нестійкості і порушення
                    поведінкової регуляції. Недостатня толерантність до
                    психічних і фізичних навантажень. Адаптація до нових
                    умов життєдіяльності, як правило, ускладнена і може
                    супроводжуватися тривалим погіршенням функціонального
                    стану організму і професійної працездатності. При
                    надзвичайно високих психічних навантаженнях можливий
                    зрив професійної діяльності.`,
    },
    {
      min: 46,
      max: 56,
      text: "2 Стен",
      description: `<p>Виражені ознаки нервово-психічної нестійкості і
                    порушення поведінкової регуляції. Низька толерантність до
                    психічних і фізичних навантажень. Адаптація до нових
                    умов життєдіяльності протікає хворобливо. Можливе
                    тривале і виражене погіршення функціонального стану
                    організму. Рівень професійної працездатності у даний
період часу низький. При посиленні психічних навантажень
достатньо вірогідний зрив професійної діяльності.`,
    },
    {
      min: 57,
      max: Infinity,
      text: "1 Стен",
      description: `<p>Вкрай високий рівень нервово-психічної нестійкості.
                    Ознаки граничних нервово-психічних розладів. Вкрай
                    низька толерантність до психічних і фізичних навантажень.
                    Адаптація до нових умов життєдіяльності протікає дуже
                    хворобливо з тривалим і вираженим погіршенням
                    функціонального стану організму. Працездатність у даний
                    період часу різко знижена. Посилення психічних
                    навантажень приводить до зриву професійної діяльності.`,
    },
  ],
  "Комунікативний потенціал": [
    {
      min: 0,
      max: 5,
      text: "10 Стен",
      description: `<p>Високий рівень комунікативних здібностей. Швидко
                    адаптується у новому колективі. Легко встановлює
                    контакти з оточуючими. У міжособистісному
                    спілкуванні неконфліктний. Завжди адекватно оцінює
                    свою роль і правильно будує міжперсональні
                    взаємостосунки у колективі`,
    },

    {
      min: 6,
      max: 6,
      text: "9 Стен",
      description: `<p>Високий рівень комунікативних здібностей. Швидко
                    адаптується у новому колективі. Легко встановлює
                    контакти з оточуючими. У міжособистісному
                    спілкуванні неконфліктний. Завжди адекватно оцінює
                    свою роль і правильно будує міжперсональні
                    взаємостосунки у колективі`,
    },

    {
      min: 7,
      max: 8,
      text: "8 Стен",
      description: `<p>Високий рівень комунікативних здібностей. Швидко
                    адаптується у новому колективі. Легко встановлює
                    контакти з оточуючими. У міжособистісному
                    спілкуванні неконфліктний. Завжди адекватно оцінює
                    свою роль і правильно будує міжперсональні
                    взаємостосунки у колективі`,
    },

    {
      min: 9,
      max: 10,
      text: "7 Стен",
      description: `<p>Достатньо високий рівень комунікативних здібностей.
Достатньо швидко адаптується у новому колективі. При
встановленні міжособистісних контактів з оточуючими,
як правило, не зазнає труднощів. У спілкуванні не
конфліктний. У більшості випадків адекватно оцінює
свою роль в колективі. На критику реагує адекватно.
Достатня здатність до корекції поведінки.`,
    },

    {
      min: 11,
      max: 12,
      text: "6 Стен",
      description: `<p>Достатній рівень комунікативних здібностей.
                    Достатньо швидко адаптується у новому колективі. При
                    встановленні міжособистісних контактів з оточуючими,
                    як правило, не зазнає труднощів. У спілкуванні не
                    конфліктний. У більшості випадків адекватно оцінює
                    свою роль в колективі. На критику реагує адекватно.
                    Достатня здатність до корекції поведінки.`,
    },

    {
      min: 13,
      max: 14,
      text: "5 Стен",
      description: `<p>Рівень комунікативних здібностей середній. У цілому
без особливих ускладнень адаптується до нового
колективу. При встановленні міжособистісних контактів
з оточуючими іноді може неправильно будувати
стратегію своєї поведінки. Разом з тим, до критичних
зауважень відноситься адекватно, здатний коригувати
свою поведінку. У спілкуванні не конфліктний.
Достатньо адекватно оцінює свою роль у колективі.`,
    },

    {
      min: 15,
      max: 17,
      text: "4 Стен",
      description: `<p>Задовільний рівень комунікативних здібностей. На
                    початковому етапі адаптації до нового колективу можуть
                    виникати ускладнення. Не завжди правильно будує
                    міжперсональні взаємостосунки, зважаючи на деяку
                    неадекватність самооцінки. На критичні зауваження на
                    свою адресу в основному реагує адекватно, хоча і дещо
                    хворобливо. В цілому здатний до корекції своєї
                    поведінки.`,
    },

    {
      min: 18,
      max: 19,
      text: "3 Стен",
      description: `<p>Понижений рівень комунікативних здібностей.
                    Наявність окремих ознак акцентуації характеру. На
                    початковому етапі адаптації до нового колективу
                    виникають значні ускладнення. Міжперсональні
                    взаємостосунки (як по горизонталі, так і по вертикалі)
                    часто будує неправильно. Хворобливо реагує на
                    критику. Недостатньо розвинута здатність до корекції
                    своєї поведінки.`,
    },

    {
      min: 20,
      max: 22,
      text: "2 Стен",
      description: `<p>Рівень комунікативних здібностей низький. Наявність
                    ознак акцентуації характеру. Початковий етап адаптації
                    до нового колективу розтягнутий у часі і, як правило,
                    протікає вельми хворобливо. Часто виникають
                    ускладнення в побудові міжособистісних контактів з
                    оточуючими, зважаючи на наявність неадекватної
                    самооцінки. Схильність до підвищеної конфліктності.
                    Хворобливо реагує на критику. Фіксований на образах,
                    що заподіяні йому оточуючими. Недостатньо розвинута
                    здатність до корекції поведінки.`,
    },

    {
      min: 23,
      max: Infinity,
      text: "1 Стен",
      description: `<p>Вкрай низький рівень комунікативних здібностей.
                    Наявність виражених ознак акцентуації характеру.
                    Адаптація до нового колективу протікає тривало і украй
                    хворобливо. Постійно випробовує утруднення в
                    побудові міжособистісних контактів з оточуючими.
                    Високий рівень конфліктності. Колективом, як правило,
                    відкидаємо. Схильний до ірраціональних вчинків. Вкрай
                    низька здатність до корекції поведінки.`,
    },
  ],
  "Моральноетична нормативність": [
    {
      min: 0,
      max: 3,
      text: "10 Стен",
      description: null,
    },

    {
      min: 4,
      max: 4,
      text: "9 Стен",
    },

    {
      min: 5,
      max: 6,
      text: "8 Стен",
    },
    {
      min: 7,
      max: 7,
      text: "7 Стен",
    },
    {
      min: 8,
      max: 9,
      text: "6 Стен",
    },
    {
      min: 10,
      max: 11,
      text: "5 Стен",
    },
    {
      min: 12,
      max: 13,
      text: "4 Стен",
    },
    {
      min: 14,
      max: 15,
      text: "3 Стен",
    },
    {
      min: 16,
      max: 16,
      text: "2 Стен",
    },
    {
      min: 17,
      max: Infinity,
      text: "1 Стен",
    },
  ],
  "Військовопрофесійна спрямованість": [
    {
      min: 0,
      max: 0,
      text: "10 Стен",
    },

    {
      min: 1,
      max: 1,
      text: "9 Стен",
    },

    {
      min: 2,
      max: 3,
      text: "8 Стен",
    },
    {
      min: 4,
      max: 4,
      text: "7 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 5,
      max: 7,
      text: "6 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 8,
      max: 10,
      text: "5 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 11,
      max: 13,
      text: "4 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 14,
      max: 15,
      text: "3 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 16,
      max: 17,
      text: "2 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 18,
      max: 25,
      text: "1 Стен",
      description: "DESCRIPTION",
    },
  ],
  "Схильність до девіантних форм поведінки": [
    {
      min: 0,
      max: 3,
      text: "10 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 4,
      max: 5,
      text: "9 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 6,
      max: 7,
      text: "8 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 8,
      max: 9,
      text: "7 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 10,
      max: 11,
      text: "6 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 12,
      max: 14,
      text: "5 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 15,
      max: 17,
      text: "4 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 18,
      max: 20,
      text: "3 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 21,
      max: 24,
      text: "2 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 25,
      max: Infinity,
      text: "1 Стен",
      description: "DESCRIPTION",
    },
  ],
  "Суїцидальний ризик": [
    {
      min: 0,
      max: 0,
      text: "9 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 1,
      max: 1,
      text: "8 Стен",
      description: "DESCRIPTION",
    },
    {
      min: 2,
      max: 2,
      text: "7 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 3,
      max: 3,
      text: "6 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 4,
      max: 4,
      text: "5 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 5,
      max: 6,
      text: "4 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 7,
      max: 9,
      text: "3 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 10,
      max: 14,
      text: "2 Стен",
      description: "DESCRIPTION",
    },

    {
      min: 15,
      max: Infinity,
      text: "1 Стен",
      description: "DESCRIPTION",
    },
  ],
};
